AccumulationRegisters/ДоходыИРасходы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ДоходыИРасходы</Name>
			<Comment>Блок учета доходов и расходов</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДоходУпр</Name>
					<Comment>Сумма дохода в управленческой валюте</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасходУпр</Name>
					<Comment>Сумма расхода в управленческой валюте</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРаспределения</Name>
					<Comment>Статья прибылей и убытков, с которой произошло распределение суммы дохода\расхода при выполнении закрытия периода</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СтатьяДоходовИРасходов</Name>
					<Comment>Статья доходов и расходов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ДоходыИРасходы/Ext/RecordSetModule.bsl
Перем ДокументОбъект Экспорт; // документ объект
Перем СтатьяДоходовИРасходов Экспорт; // Статья ДДС
Перем Подразделение Экспорт; // если неопределено, то берется из ДокументОбъект
Перем ВУпрВалюте Экспорт; // если Истина, то суммы переданы в валюте упр. учета и пересчитывать их не надо
Перем Доход Экспорт; // доход
Перем Расход Экспорт; // расход
Перем ШапкаДокумента Экспорт; 			// Выборка или строка таблицы значений, в которой содержаться необходимые данные о шапке документа
Перем РежимПроведения Экспорт;		// Режим проведения документа оперативный/неоперативный
Перем ХозОперация Экспорт; // Хозяйственная операция. Если пустое, то берется из документа.
Перем СтатьяДиРИсточник Экспорт; // Статья доходов и расходов, с которой произошло распределение.
								 // Используется в документе "Закрытие периода".

// фиксируем доходы/расходы
Функция Приход() Экспорт
	Если ШапкаДокумента=Неопределено Тогда ШапкаДокумента=ДокументОбъект; КонецЕсли;
	Доход=?(Доход=Неопределено ИЛИ Доход=NULL,0,Доход);
	Расход=?(Расход=Неопределено ИЛИ Расход=NULL,0,Расход);
	// проверим
	Если Доход=0 И Расход=0 Тогда 
		// убиваем циклическую ссылку
		ДокументОбъект=Неопределено;
		ШапкаДокумента=Неопределено;
		Возврат Истина; 
	КонецЕсли;
	
	Если обЗначениеНеЗаполнено(Подразделение) Тогда
		Подразделение = ШапкаДокумента.ПодразделениеКомпании;
	КонецЕсли;
	
	ВУпрВалюте=?(ВУпрВалюте=Неопределено,Ложь,ВУпрВалюте);
	ВалютаУпр=Константы.ВалютаУправленческогоУчетаКомпании.Получить();
	// движения
	НоваяЗапись=Добавить();
	НоваяЗапись.ВидДвижения=ВидДвиженияНакопления.Приход;
	НоваяЗапись.Период=ШапкаДокумента.Дата;
	НоваяЗапись.Регистратор=ШапкаДокумента.Ссылка;
	НоваяЗапись.ПодразделениеКомпании=Подразделение;
	НоваяЗапись.СтатьяДоходовИРасходов=СтатьяДоходовИРасходов;
	Если ВУпрВалюте Тогда
		НоваяЗапись.ДоходУпр=Окр(Доход,2);
		НоваяЗапись.РасходУпр=Окр(Расход,2);
	Иначе
		НоваяЗапись.ДоходУпр=Окр(обПересчет(Доход,ШапкаДокумента.ВалютаДокумента,ШапкаДокумента.КурсДокумента,ВалютаУпр,?(обЗначениеНеЗаполнено(ШапкаДокумента.КурсВалютыУпр), ШапкаДокумента.Дата, ШапкаДокумента.КурсВалютыУпр)),2);
		НоваяЗапись.РасходУпр=Окр(обПересчет(Расход,ШапкаДокумента.ВалютаДокумента,ШапкаДокумента.КурсДокумента,ВалютаУпр,?(обЗначениеНеЗаполнено(ШапкаДокумента.КурсВалютыУпр), ШапкаДокумента.Дата, ШапкаДокумента.КурсВалютыУпр)),2);
	КонецЕсли;
	// Хоз. операция
	Если ХозОперация=Неопределено Тогда
		ХозОперация = ШапкаДокумента.ХозОперация;
	КонецЕсли;  	
	НоваяЗапись.ХозОперация = ХозОперация;
	
	// Распределяемая статья.
	Если СтатьяДиРИсточник<>Неопределено Тогда
		НоваяЗапись.СтатьяРаспределения = СтатьяДиРИсточник;			
	КонецЕсли;   	
	
	// обнуляем переменные
	Подразделение = Неопределено;
	Доход=0; Расход=0; ВУпрВалюте=Ложь;
	
	// убиваем циклическую ссылку
	ДокументОбъект=Неопределено;
	ШапкаДокумента=Неопределено;
	
	Возврат Истина;
КонецФункции

// фиксируем доходы/расходы
Функция Расход() Экспорт
	Если ШапкаДокумента=Неопределено Тогда ШапкаДокумента=ДокументОбъект; КонецЕсли;
	Доход=?(Доход=Неопределено ИЛИ Доход=NULL,0,Доход);
	Расход=?(Расход=Неопределено ИЛИ Расход=NULL,0,Расход);
	// проверим
	Если Доход=0 И Расход=0 Тогда 
		// убиваем циклическую ссылку
		ДокументОбъект=Неопределено;
		ШапкаДокумента=Неопределено;
		Возврат Истина; 
	КонецЕсли;
	
	Если обЗначениеНеЗаполнено(Подразделение) Тогда
		Подразделение = ШапкаДокумента.ПодразделениеКомпании;
	КонецЕсли;
	
	ВУпрВалюте=?(ВУпрВалюте=Неопределено,Ложь,ВУпрВалюте);
	ВалютаУпр=Константы.ВалютаУправленческогоУчетаКомпании.Получить();
	// движения
	НоваяЗапись=Добавить();
	НоваяЗапись.ВидДвижения=ВидДвиженияНакопления.Расход;
	НоваяЗапись.Период=ШапкаДокумента.Дата;
	НоваяЗапись.Регистратор=ШапкаДокумента.Ссылка;
	НоваяЗапись.ПодразделениеКомпании=Подразделение;
	НоваяЗапись.СтатьяДоходовИРасходов=СтатьяДоходовИРасходов;
	Если ВУпрВалюте Тогда
		НоваяЗапись.ДоходУпр=Окр(Доход,2);
		НоваяЗапись.РасходУпр=Окр(Расход,2);
	Иначе
		НоваяЗапись.ДоходУпр=Окр(обПересчет(Доход,ШапкаДокумента.ВалютаДокумента,ШапкаДокумента.КурсДокумента,ВалютаУпр,?(обЗначениеНеЗаполнено(ШапкаДокумента.КурсВалютыУпр), ШапкаДокумента.Дата, ШапкаДокумента.КурсВалютыУпр)),2);
		НоваяЗапись.РасходУпр=Окр(обПересчет(Расход,ШапкаДокумента.ВалютаДокумента,ШапкаДокумента.КурсДокумента,ВалютаУпр,?(обЗначениеНеЗаполнено(ШапкаДокумента.КурсВалютыУпр), ШапкаДокумента.Дата, ШапкаДокумента.КурсВалютыУпр)),2);
	КонецЕсли;
	// Хоз. операция
	Если ХозОперация=Неопределено Тогда
		ХозОперация = ШапкаДокумента.ХозОперация;
	КонецЕсли;  	
	НоваяЗапись.ХозОперация = ХозОперация;
		
	// обнуляем переменные
	Подразделение = Неопределено;
	Доход=0; Расход=0; ВУпрВалюте=Ложь;
	
	// убиваем циклическую ссылку
	ДокументОбъект=Неопределено;
	ШапкаДокумента=Неопределено;
	
	Возврат Истина;
КонецФункции

// Предопределенная процедура
Процедура ПриЗаписи(Отказ, Замещение)
	
	// Зарегистрируем изменения для узлов РБД
	орРегистрацияИзменений(ЭтотОбъект);
	
КонецПроцедуры	//	ПриЗаписи()
